c5/src/Documents/IOSheet/IOSheet.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>IOSheet</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IOSheet1</name>
    <type>
      <types>DocumentRef.IOSheet</types>
    </type>
  </attributes>
  <attributes>
    <name>IOSheet2</name>
    <type>
      <types>DocumentRef.IOSheet</types>
    </type>
  </attributes>
  <attributes>
    <name>IOSheet3</name>
    <type>
      <types>DocumentRef.IOSheet</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Balance</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Inventory</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Package1</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Package2</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Package3</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity1</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity2</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity3</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg1</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg2</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg3</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/AccumulationRegisters/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Items</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

c5/src/Catalogs/Features/Features.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Features</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Items</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Accuracy</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BOM</name>
    <type>
      <types>CatalogRef.BOM</types>
    </type>
  </attributes>
  <attributes>
    <name>CostMethod</name>
    <type>
      <types>EnumRef.Cost</types>
    </type>
  </attributes>
  <attributes>
    <name>CountPackages</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsGroup</name>
    <type>
      <types>CatalogRef.CustomsGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>Features</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Form</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>CatalogRef.ItemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>OfficialCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceGroup</name>
    <type>
      <types>CatalogRef.PriceGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>Producer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Social</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/Documents/IOSheet/Forms/Form/Module.bsl
&AtServer
var Copy;
&AtServer
var Env;
&AtClient
var ItemsRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Constraints.ShowAccess ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		Copy = not Parameters.CopyingValue.IsEmpty ();
		DocumentForm.Init ( Object );
		fillNew ();
		fillByCustomer ();
		Constraints.ShowAccess ( ThisObject );
	endif; 
	setAccuracy ();
	setLinks ();
	Options.Company ( ThisObject, Object.Company );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Links show ShowLinks;
	|IOSheet1 show filled ( Object.IOSheet1 );
	|IOSheet2 show filled ( Object.IOSheet2 );
	|IOSheet3 show filled ( Object.IOSheet3 )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( Copy
		or Parameters.Basis <> undefined ) then
		return;
	endif; 
	if ( Object.Warehouse.IsEmpty () ) then
		settings = Logins.Settings ( "Company, Warehouse" );
		Object.Company = settings.Company;
		Object.Warehouse = settings.Warehouse;
	else
		Object.Company = DF.Pick ( Object.Warehouse, "Owner" );
	endif;
	
EndProcedure 

&AtServer
Procedure fillByCustomer ()
	
	apply = Parameters.FillingValues.Property ( "Customer" )
	and not Copy
	and not Object.Customer.IsEmpty ();
	if ( apply ) then
		fillDocument ();
		Appearance.Apply ( ThisObject );
	endif;

EndProcedure 

&AtServer
Procedure fillDocument ()
	
	SQL.Init ( Env );
	sqlSheets ();
	Env.Q.SetParameter ( "Date", ? ( Object.Date = Date ( 1, 1, 1 ), CurrentSessionDate (), Object.Date ) );
	Env.Q.SetParameter ( "Ref", Object.Ref );
	Env.Q.SetParameter ( "Customer", Object.Customer );
	Env.Q.SetParameter ( "Warehouse", Object.Warehouse );
	SQL.Perform ( Env );
	sqlHistory ();
	sqlItems ();
	SQL.Perform ( Env );
	loadData ();
	
EndProcedure

&AtServer
Procedure sqlSheets ()
	
	s = "
	|// #Sheets
	|select allowed top 3 Sheets.Ref as Ref, Sheets.Date as Date
	|from Document.IOSheet as Sheets
	|where Sheets.Posted
	|and Sheets.Customer = &Customer
	|and Sheets.Warehouse = &Warehouse
	|and Sheets.Ref <> &Ref
	|and Sheets.Date <= &Date
	|order by Sheets.Date desc
	|";
	Env.Selection.Add ( s );
	
EndProcedure 

&AtServer
Procedure sqlHistory ()
	
	fields = new Array ();
	joins = new Array ();
	Env.Insert ( "History", Env.Sheets.Count () );
	for i = 1 to Env.History do
		field = "" + i;
		alias = "History" + field;
		fields.Add ( alias + ".Package as Package" + field );
		fields.Add ( alias + ".Quantity as Quantity" + field );
		fields.Add ( alias + ".QuantityPkg as QuantityPkg" + field );
		s = "
		|	left join Document.IOSheet.Items as " + alias + "
		|	on " + alias + ".Ref = &" + alias + "
		|	and " + alias + ".Item = Items.Ref
		|	and " + alias + ".Package = isnull ( Packages.Ref, value ( Catalog.Packages.EmptyRef ) )
		|	and " + alias + ".Feature = isnull ( Features.Ref, value ( Catalog.Features.EmptyRef ) )
		|";
		joins.Add ( s );
		Env.Q.SetParameter ( alias, Env.Sheets [ i - 1 ].Ref );
	enddo; 
	Env.Insert ( "Fields", StrConcat ( fields, "," ) );
	Env.Insert ( "Joins", StrConcat ( joins, " " ) );
	
EndProcedure 

&AtServer
Procedure sqlItems ()
	
	s = "
	|select Balances.Item as Item, Balances.Feature as Feature, Balances.Package as Package,
	|	Balances.QuantityBalance as Balance
	|into Balances
	|from AccumulationRegister.Items.Balance ( , Warehouse = &Warehouse ) as Balances
	|index by Item, Feature, Package
	|;
	|// #Items
	|select Items.Ref as Item, Packages.Ref as Package, isnull ( Packages.Capacity, 1 ) as Capacity,
	|	Features.Ref as Feature, isnull ( BalancesPackages.Balance, Balances.Balance ) as Balance";
	if ( Env.History > 0 ) then
		s = s + ", " + Env.Fields;
	endif;
	s = s + "
	|from Catalog.Items as Items
	|	//
	|	// Packages
	|	//
	|	left join Catalog.Packages as Packages
	|	on Packages.Owner = Items.Ref
	|	and not Packages.DeletionMark
	|	//
	|	// Features
	|	//
	|	left join Catalog.Features as Features
	|	on Features.Owner = Items.Ref
	|	and not Features.DeletionMark
	|	//
	|	// BalancesPackages
	|	//
	|	left join Balances as BalancesPackages
	|	on Items.CountPackages
	|	and BalancesPackages.Item = Items.Ref
	|	and BalancesPackages.Feature = isnull ( Features.Ref, value ( Catalog.Features.EmptyRef ) )
	|	and BalancesPackages.Package = Packages.Ref
	|	//
	|	// Balances
	|	//
	|	left join Balances as Balances
	|	on not Items.CountPackages
	|	and Balances.Item = Items.Ref
	|	and Balances.Feature = isnull ( Features.Ref, value ( Catalog.Features.EmptyRef ) )
	|";
	if ( Env.History > 0 ) then
		s = s + Env.Joins;
	endif;
	s = s + "
	|where not Items.DeletionMark
	|and not Items.Service
	|and not Items.IsFolder
	|order by Items.Description, Packages.Capacity
	|";
	Env.Selection.Add ( s );
	
EndProcedure 

&AtServer
Procedure loadData ()
	
	Object.Items.Load ( Env.Items );
	table = Env.Sheets;
	for i = 1 to 3 do
		iosheet = "IOSheet" + i;
		if ( i > Env.History ) then
			Object [ iosheet ] = undefined;
		else
			Object [ iosheet ] = table [ i - 1 ].Ref;
		endif; 
		#if ( not WebClient ) then
			// 8.3.6.2100 Bug workaround
			column = Items [ "ItemsIO" + i ];
			if ( Object.Ref.IsEmpty () ) then
				column.Title = " "; // It enforces to refresh columns title
			endif; 
		#endif
	enddo; 
	
EndProcedure 

&AtServer
Procedure setAccuracy ()
	
	Options.SetAccuracy ( ThisObject, "ItemsBalance, ItemsQuantity1, ItemsQuantityPkg1, ItemsQuantity2, ItemsQuantityPkg2, ItemsQuantity3, ItemsQuantityPkg3", , false );
	Options.SetAccuracy ( ThisObject, "ItemsQuantity, ItemsQuantityPkg" );
	Options.SetAccuracy ( ThisObject, "ItemsTotalQuantityPkg, ItemsTotalQuantity", false );
	
EndProcedure 

&AtServer
Procedure setLinks ()
	
	if ( Object.Ref.IsEmpty () ) then
		ShowLinks = false;
		return;
	endif; 
	SQL.Init ( Env );
	sqlLinks ();
	Env.Q.SetParameter ( "Ref", Object.Ref );
	SQL.Perform ( Env );
	setURLPanel ();
	Appearance.Apply ( ThisObject, "ShowLinks" );

EndProcedure 

&AtServer
Procedure sqlLinks ()
	
	s = "
	|// #SalesOrders
	|select Documents.Ref as Document, Documents.Date as Date, Documents.Number as Number
	|from Document.SalesOrder as Documents
	|where Documents.IOSheet = &Ref
	|and not Documents.DeletionMark
	|order by Date
	|";
	Env.Selection.Add ( s );
	
EndProcedure 

&AtServer
Procedure setURLPanel ()
	
	parts = new Array ();
	meta = Metadata.Documents;
	parts.Add ( URLPanel.DocumentsToURL ( Env.SalesOrders, meta.SalesOrder ) );
	s = URLPanel.Build ( parts );
	if ( s = undefined ) then
		ShowLinks = false;
	else
		ShowLinks = true;
		Links = s;
	endif; 
	
EndProcedure 

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageBarcodeScanned ()
		and Source.FormOwner.UUID = ThisObject.UUID ) then
		activateItem ( Parameter );
	elsif ( EventName = Enum.MessageChangesPermissionIsSaved ()
		and ( Parameter = Object.Ref
			or Parameter = BegOfDay ( Object.Date ) ) ) then
		updateChangesPermission ();
	endif;

EndProcedure

&AtClient
Procedure activateItem ( Fields )
	
	search = new Structure ( "Item, Package, Feature" );
	FillPropertyValues ( search, Fields );
	rows = Object.Items.FindRows ( search );
	if ( rows.Count () = 0 ) then
		Output.ItemNotFound ();
	else
		ItemsRow = rows [ 0 ];
		Items.Items.CurrentRow = ItemsRow.GetID ();
	endif; 
	
EndProcedure 

&AtServer
Procedure updateChangesPermission ()

	Constraints.ShowAccess ( ThisObject );

EndProcedure

&AtClient
Procedure NewWriteProcessing ( NewObject, Source, StandardProcessing )
	
	setLinks ();
	
EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure CompanyOnChange ( Item )
	
	Options.ApplyCompany ( ThisObject );
	
EndProcedure

&AtClient
Procedure CustomerOnChange ( Item )
	
	refill ();
	
EndProcedure

&AtServer
Procedure refill ()
	
	fillDocument ();
	Appearance.Apply ( ThisObject );
	
EndProcedure 

&AtClient
Procedure WarehouseOnChange ( Item )
	
	refill ();
	
EndProcedure

// *****************************************
// *********** Table Items

&AtClient
Procedure Scan ( Command )
	
	ScanForm.Scan ( ThisObject );
	
EndProcedure

&AtClient
Procedure ItemsBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ItemsBeforeDeleteRow ( Item, Cancel )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ItemsOnActivateRow ( Item )
	
	ItemsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ItemsQuantityPkgOnChange ( Item )
	
	Computations.Units ( ItemsRow );
	
EndProcedure

&AtClient
Procedure ItemsQuantityOnChange ( Item )
	
	Computations.Packages ( ItemsRow );
	
EndProcedure
